# Задача 2. Бабушка

user_text = input('Введите текст: ')
user_text = user_text.split()
user_text  = ' '.join(user_text)

print('Исправленный текст:', user_text)
